{"merges": {"101,32": 256, "100,32": 257, "32,116": 258, "46,32": 259, "32,97": 260, "104,256": 261, "104,101": 262, "121,32": 263, "116,32": 264, "110,257": 265, "115,32": 266, "101,257": 267, "111,32": 268, "119,97": 269, "105,110": 270, "44,32": 271, "260,265": 272, "111,117": 273, "104,97": 274, "258,261": 275, "101,114": 276, "101,110": 277, "111,109": 278, "105,116": 279, "262,114": 280, "105,108": 281, "111,110": 282, "105,109": 283, "259,84": 284, "97,114": 285, "111,114": 286, "115,97": 287, "46,10": 288, "267,116": 289, "262,263": 290, "270,103": 291, "260,32": 292, "97,110": 293, "105,100": 294, "114,101": 295, "108,108": 296, "76,281": 297, "97,121": 298, "108,111": 299, "269,266": 300, "105,266": 301, "112,108": 302, "258,268": 303, "259,83": 304, "115,116": 305, "259,72": 306, "100,111": 307, "258,111": 308, "256,116": 309, "97,265": 310, "104,32": 311, "97,109": 312, "289,268": 313, "110,111": 314, "304,261": 315, "280,32": 316, "114,105": 317, "306,256": 318, "101,116": 319, "284,290": 320, "99,107": 321, "119,279": 322, "79,110": 323, "104,301": 324, "97,32": 325, "105,114": 326, "118,276": 327, "34,32": 328, "105,103": 329, "105,264": 330, "274,264": 331, "291,32": 332, "117,112": 333, "269,115": 334, "101,115": 335, "101,120": 336, "111,107": 337, "117,110": 338, "108,105": 339, "102,286": 340, "278,32": 341, "121,273": 342, "102,116": 343, "109,263": 344, "100,298": 345, "108,32": 346, "98,117": 347, "297,121": 348, "322,311": 349, "97,116": 350, "108,257": 351, "101,100": 352, "287,294": 353, "269,110": 354, "115,261": 355, "97,263": 356, "112,112": 357, "108,101": 358, "297,263": 359, "44,258": 360, "99,256": 361, "105,115": 362, "39,266": 363, "84,283": 364, "108,256": 365, "98,101": 366, "97,296": 367, "111,102": 368, "111,116": 369, "354,116": 370, "271,34": 371, "336,116": 372, "115,101": 373, "279,116": 374, "111,119": 375, "60,124": 376, "376,277": 377, "377,307": 378, "378,343": 379, "379,372": 380, "380,124": 381, "381,62": 382, "382,10": 383, "102,317": 384, "274,257": 385, "258,262": 386, "277,100": 387, "97,107": 388, "274,357": 389, "98,329": 390, "258,283": 391, "259,73": 392, "327,263": 393, "102,101": 394, "280,256": 395, "284,261": 396, "288,383": 397, "270,275": 398, "256,345": 399, "118,256": 400, "334,292": 401, "287,119": 402, "302,298": 403, "110,312": 404, "293,32": 405, "323,399": 406, "109,121": 407, "282,260": 408, "391,101": 409, "314,264": 410, "108,374": 411, "404,267": 412, "411,365": 413, "99,285": 414, "258,331": 415, "117,115": 416, "97,100": 417, "360,395": 418, "114,256": 419, "272,116": 420, "98,111": 421, "103,111": 422, "323,361": 423, "423,333": 424, "424,408": 425, "425,409": 426, "384,387": 427, "273,351": 428, "302,356": 429, "39,264": 430, "34,10": 431, "119,276": 432, "97,115": 433, "389,121": 434, "110,101": 435, "418,401": 436, "271,347": 437, "109,278": 438, "426,436": 439, "299,118": 440, "114,111": 441, "288,34": 442, "339,107": 443, "105,257": 444, "353,371": 445, "340,32": 446, "104,283": 447, "397,439": 448, "115,268": 449, "116,276": 450, "66,277": 451, "406,271": 452, "390,32": 453, "114,121": 454, "262,108": 455, "285,107": 456, "99,97": 457, "262,110": 458, "66,117": 459, "256,310": 460, "99,104": 461, "119,277": 462, "455,112": 463, "299,337": 464, "97,321": 465, "309,268": 466, "103,104": 467, "267,310": 468, "98,256": 469, "105,99": 470, "437,264": 471, "73,32": 472, "97,270": 473, "115,278": 474, "97,108": 475, "115,104": 476, "273,265": 477, "368,32": 478, "284,283": 479, "392,264": 480, "109,341": 481, "308,275": 482, "258,290": 483, "388,256": 484, "273,116": 485, "432,256": 486, "309,261": 487, "274,116": 488, "103,319": 489, "259,452": 490, "101,97": 491, "46,431": 492, "110,430": 493, "326,32": 494, "115,109": 495, "112,117": 496, "440,313": 497, "121,260": 498, "97,120": 499, "115,294": 500, "342,32": 501, "77,499": 502, "119,32": 503, "112,456": 504, "116,261": 505, "282,275": 506, "115,272": 507, "296,32": 508, "370,313": 509, "119,104": 510, "114,97": 511, "276,32": 512, "259,34": 513, "102,117": 514, "394,108": 515, "448,413": 516, "289,261": 517, "99,111": 518, "269,121": 519, "33,328": 520, "300,393": 521, "116,111": 522, "89,273": 523, "112,111": 524, "102,114": 525, "99,311": 526, "103,326": 527, "98,367": 528, "402,292": 529, "104,273": 530, "107,32": 531, "108,121": 532, "527,346": 533, "109,32": 534, "259,10": 535, "515,264": 536, "33,32": 537, "104,117": 538, "364,407": 539, "322,104": 540, "99,312": 541, "109,101": 542, "364,344": 543, "262,257": 544, "274,110": 545, "98,465": 546, "105,265": 547, "77,278": 548, "102,338": 549, "429,349": 550, "119,101": 551, "109,484": 552, "44,328": 553, "107,267": 554, "385,325": 555, "103,32": 556, "109,286": 557, "370,303": 558, "114,117": 559, "284,262": 560, "100,444": 561, "119,428": 562, "329,104": 563, "259,459": 564, "100,101": 565, "116,275": 566, "288,84": 567, "533,412": 568, "285,116": 569, "46,328": 570, "270,32": 571, "386,494": 572, "282,32": 573, "259,359": 574, "114,293": 575, "99,405": 576, "63,328": 577, "458,32": 578, "97,257": 579, "479,344": 580, "464,267": 581, "101,266": 582, "100,356": 583, "427,115": 584, "97,118": 585, "111,257": 586, "102,477": 587, "100,100": 588, "348,272": 589, "99,428": 590, "101,271": 591, "495,281": 592, "281,346": 593, "100,294": 594, "115,274": 595, "287,444": 596, "84,278": 597, "457,416": 598, "462,116": 599, "462,264": 600, "366,598": 601, "119,286": 602, "121,115": 603, "103,473": 604, "474,256": 605, "316,438": 606, "421,263": 607, "114,32": 608, "260,110": 609, "561,410": 610, "107,314": 611, "105,102": 612, "258,104": 613, "282,103": 614, "275,115": 615, "44,272": 616, "274,400": 617, "309,111": 618, "502,32": 619, "99,293": 620, "111,112": 621, "277,116": 622, "260,419": 623, "463,32": 624, "451,32": 625, "121,272": 626, "116,104": 627, "594,493": 628, "104,278": 629, "601,256": 630, "97,117": 631, "108,100": 632, "259,65": 633, "99,278": 634, "260,115": 635, "105,321": 636, "99,108": 637, "101,112": 638, "287,257": 639, "115,111": 640, "277,32": 641, "98,114": 642, "485,500": 643, "259,523": 644, "568,348": 645, "110,110": 646, "489,280": 647, "307,119": 648, "109,417": 649, "289,111": 650, "114,278": 651, "102,111": 652, "394,101": 653, "285,110": 654, "360,290": 655, "110,100": 656, "115,414": 657, "102,299": 658, "104,362": 659, "101,514": 660, "289,331": 661, "112,295": 662, "420,261": 663, "101,264": 664, "103,268": 665, "119,256": 666, "84,341": 667, "305,569": 668, "115,112": 669, "541,256": 670, "648,110": 671, "98,326": 672, "117,295": 673, "115,286": 674, "99,273": 675, "102,547": 676, "373,256": 677, "99,294": 678, "645,315": 679, "342,608": 680, "392,32": 681, "300,449": 682, "119,578": 683, "117,109": 684, "293,116": 685, "358,654": 686, "564,264": 687, "649,256": 688, "560,498": 689, "70,651": 690, "415,583": 691, "691,282": 692, "101,265": 693, "281,108": 694, "368,275": 695, "105,361": 696, "44,292": 697, "101,327": 698, "103,105": 699, "386,109": 700, "467,264": 701, "273,264": 702, "65,646": 703, "97,98": 704, "103,114": 705, "349,324": 706, "77,105": 707, "259,87": 708, "100,263": 709, "98,98": 710, "690,692": 711, "402,32": 712, "117,114": 713, "271,348": 714, "121,258": 715, "104,375": 716, "369,280": 717, "84,261": 718, "314,116": 719, "103,103": 720, "114,338": 721, "510,268": 722, "319,450": 723, "282,430": 724, "516,679": 725, "347,116": 726, "467,116": 727, "403,332": 728, "443,256": 729, "97,99": 730, "116,268": 731, "607,412": 732, "435,503": 733, "83,312": 734, "109,293": 735, "286,32": 736, "99,295": 737, "275,116": 738, "662,116": 739, "99,350": 740, "447,32": 741, "422,586": 742, "308,111": 743, "545,531": 744, "367,32": 745, "260,604": 746, "307,556": 747, "565,678": 748, "102,108": 749, "726,450": 750, "474,319": 751, "414,660": 752, "103,295": 753, "668,313": 754, "282,256": 755, "262,285": 756, "258,295": 757, "104,111": 758, "308,268": 759, "563,116": 760, "97,264": 761, "299,116": 762, "675,632": 763, "119,593": 764, "398,504": 765, "97,305": 766, "113,117": 767, "109,405": 768, "101,296": 769, "98,295": 770, "538,114": 771, "287,603": 772, "496,264": 773, "443,313": 774, "308,647": 775, "273,257": 776, "269,108": 777, "260,98": 778, "108,335": 779, "348,363": 780, "557,256": 781, "112,470": 782, "287,100": 783, "260,114": 784, "112,114": 785, "282,101": 786, "44,275": 787, "116,386": 788, "421,120": 789, "115,320": 790, "103,285": 791, "658,432": 792, "270,500": 793, "269,450": 794, "292,453": 795, "317,313": 796, "763,493": 797, "338,100": 798, "384,693": 799, "100,268": 800, "111,271": 801, "103,369": 802, "674,454": 803, "107,101": 804, "118,101": 805, "305,111": 806, "77,341": 807, "107,352": 808, "112,32": 809, "457,264": 810, "482,504": 811, "260,519": 812, "422,264": 813, "434,272": 814, "99,358": 815, "420,290": 816, "260,108": 817, "83,117": 818, "434,303": 819, "427,266": 820, "299,115": 821, "528,32": 822, "274,118": 823, "103,97": 824, "330,300": 825, "111,327": 826, "441,278": 827, "316,481": 828, "117,321": 829, "703,97": 830, "744,342": 831, "109,117": 832, "672,257": 833, "525,278": 834, "269,116": 835, "305,286": 836, "748,313": 837, "291,115": 838, "644,32": 839, "114,263": 840, "39,115": 841, "98,723": 842, "491,264": 843, "103,454": 844, "525,341": 845, "592,468": 846, "259,711": 847, "307,103": 848, "309,262": 849, "739,116": 850, "471,261": 851, "115,256": 852, "103,256": 853, "333,272": 854, "115,119": 855, "33,431": 856, "258,488": 857, "105,101": 858, "83,285": 859, "101,393": 860, "403,267": 861, "343,276": 862, "110,263": 863, "440,267": 864, "824,400": 865, "698,121": 866, "337,32": 867, "99,262": 868, "611,119": 869, "559,321": 870, "119,331": 871, "112,369": 872, "319,363": 873, "633,265": 874, "320,486": 875, "104,332": 876, "519,266": 877, "274,114": 878, "416,264": 879, "364,32": 880, "595,114": 881, "279,363": 882, "99,101": 883, "737,312": 884, "782,116": 885, "285,32": 886, "686,661": 887, "115,338": 888, "273,656": 889, "271,261": 890, "330,334": 891, "100,295": 892, "476,270": 893, "295,302": 894, "441,321": 895, "314,119": 896, "375,110": 897, "497,429": 898, "336,99": 899, "899,279": 900, "289,262": 901, "108,117": 902, "105,282": 903, "367,263": 904, "653,108": 905, "397,10": 906, "524,264": 907, "894,105": 908, "260,508": 909, "271,355": 910, "435,119": 911, "375,32": 912, "611,503": 913, "101,318": 914, "788,110": 915, "110,470": 916, "271,359": 917, "97,112": 918, "102,32": 919, "112,636": 920, "101,350": 921, "100,724": 922, "333,32": 923, "314,362": 924, "587,325": 925, "308,351": 926, "445,472": 927, "260,296": 928, "288,65": 929, "98,369": 930, "308,258": 931, "538,720": 932, "433,554": 933, "516,732": 934, "798,276": 935, "67,405": 936, "102,270": 937, "115,303": 938, "458,483": 939, "100,417": 940, "99,116": 941, "689,419": 942, "402,275": 943, "860,345": 944, "306,309": 945, "599,303": 946, "267,279": 947, "791,100": 948, "612,32": 949, "114,614": 950, "102,532": 951, "283,112": 952, "491,526": 953, "279,256": 954, "653,346": 955, "421,337": 956, "98,105": 957, "335,264": 958, "637,283": 959, "959,98": 960, "335,271": 961, "480,300": 962, "288,452": 963, "756,257": 964, "699,400": 965, "707,325": 966, "108,631": 967, "109,98": 968, "659,308": 969, "109,97": 970, "266,478": 971, "459,264": 972, "539,580": 973, "291,266": 974, "540,275": 975, "435,327": 976, "609,121": 977, "544,505": 978, "635,554": 979, "751,876": 980, "567,261": 981, "369,316": 982, "103,664": 983, "108,614": 984, "630,261": 985, "307,296": 986, "99,105": 987, "109,362": 988, "101,315": 989, "349,316": 990, "106,111": 991, "952,286": 992, "992,116": 993, "109,388": 994, "119,488": 995, "352,709": 996, "996,366": 997, "299,400": 998, "352,371": 999, "335,272": 1000, "306,301": 1001, "445,84": 1002, "529,453": 1003, "295,97": 1004, "106,879": 1005, "111,100": 1006, "108,294": 1007, "111,351": 1008, "109,111": 1009, "288,359": 1010, "115,713": 1011, "102,766": 1012, "99,117": 1013, "588,277": 1014, "510,281": 1015, "993,685": 1016, "108,263": 1017, "260,116": 1018, "114,473": 1019, "708,256": 1020, "112,101": 1021, "97,281": 1022, "260,566": 1023, "539,363": 1024, "567,290": 1025, "416,104": 1026, "353,513": 1027, "800,410": 1028, "115,354": 1029, "831,271": 1030, "403,650": 1031, "339,118": 1032, "267,325": 1033, "976,32": 1034, "639,310": 1035, "358,585": 1036, "101,118": 1037, "585,286": 1038, "785,776": 1039, "489,316": 1040, "84,290": 1041, "340,275": 1042, "490,355": 1043, "269,279": 1044, "110,121": 1045, "115,115": 1046, "340,292": 1047, "115,262": 1048, "83,872": 1049, "373,487": 1050, "389,263": 1051, "479,32": 1052, "530,701": 1053, "291,272": 1054, "518,108": 1055, "948,277": 1056, "1014,532": 1057, "109,256": 1058, "314,588": 1059, "39,534": 1060, "570,10": 1061, "99,282": 1062, "859,97": 1063, "299,321": 1064, "784,477": 1065, "102,1038": 1066, "752,108": 1067, "546,32": 1068, "549,32": 1069, "777,107": 1070, "415,261": 1071, "707,97": 1072, "823,466": 1073, "476,375": 1074, "100,121": 1075, "339,305": 1076, "1076,277": 1077, "267,324": 1078, "557,101": 1079, "762,971": 1080, "373,108": 1081, "630,355": 1082, "652,369": 1083, "368,102": 1084, "111,337": 1085, "635,808": 1086, "106,117": 1087, "885,673": 1088, "442,87": 1089, "465,32": 1090, "63,431": 1091, "83,261": 1092, "540,292": 1093, "306,512": 1094, "304,117": 1095, "530,373": 1096, "102,285": 1097, "497,550": 1098, "111,108": 1099, "117,419": 1100, "657,352": 1101, "771,116": 1102, "287,121": 1103, "122,122": 1104, "696,884": 1105, "112,473": 1106, "396,387": 1107, "286,110": 1108, "272,325": 1109, "997,285": 1110, "793,101": 1111, "39,419": 1112, "104,694": 1113, "97,604": 1114, "471,355": 1115, "76,873": 1116, "259,619": 1117, "366,332": 1118, "284,341": 1119, "291,303": 1120, "115,107": 1121, "476,428": 1122, "834,275": 1123, "115,551": 1124, "390,271": 1125, "542,968": 1126, "1126,276": 1127, "259,406": 1128, "595,419": 1129, "270,107": 1130, "267,316": 1131, "116,295": 1132, "778,702": 1133, "282,292": 1134, "735,263": 1135, "103,101": 1136, "650,258": 1137, "291,275": 1138, "511,710": 1139, "274,115": 1140, "271,543": 1141, "832,526": 1142, "116,363": 1143, "104,294": 1144, "100,511": 1145, "104,621": 1146, "575,100": 1147, "121,271": 1148, "326,305": 1149, "98,958": 1150, "121,315": 1151, "260,258": 1152, "97,346": 1153, "117,99": 1154, "270,522": 1155, "446,463": 1156, "100,293": 1157, "269,263": 1158, "258,796": 1159, "89,961": 1160, "669,101": 1161, "295,1127": 1162, "1055,286": 1163, "350,256": 1164, "116,262": 1165, "920,267": 1166, "106,684": 1167, "634,256": 1168, "305,593": 1169, "386,534": 1170, "99,821": 1171, "716,303": 1172, "953,717": 1173, "771,264": 1174, "438,407": 1175, "548,407": 1176, "121,318": 1177, "102,102": 1178, "806,357": 1179, "934,973": 1180, "643,256": 1181, "109,270": 1182, "1004,339": 1183, "1183,122": 1184, "271,451": 1185, "542,293": 1186, "347,710": 1187, "815,293": 1188, "908,999": 1189, "294,491": 1190, "338,116": 1191, "415,355": 1192, "599,811": 1193, "526,279": 1194, "461,275": 1195, "437,116": 1196, "107,733": 1197, "385,731": 1198, "878,257": 1199, "706,584": 1200, "804,638": 1201, "602,107": 1202, "581,761": 1203, "103,312": 1204, "109,285": 1205, "269,114": 1206, "352,315": 1207, "105,305": 1208, "100,579": 1209, "76,1085": 1210, "280,101": 1211, "905,332": 1212, "293,107": 1213, "353,271": 1214, "103,1147": 1215, "353,288": 1216, "830,272": 1217, "272,445": 1218, "366,670": 1219, "627,332": 1220, "530,727": 1221, "271,449": 1222, "817,877": 1223, "1031,1040": 1224, "571,324": 1225, "629,101": 1226, "273,115": 1227, "629,591": 1228, "850,121": 1229, "358,638": 1230, "271,666": 1231, "778,485": 1232, "490,261": 1233, "32,300": 1234, "433,256": 1235, "302,685": 1236, "1039,478": 1237, "302,256": 1238, "628,558": 1239, "552,325": 1240, "258,870": 1241, "548,344": 1242, "112,276": 1243, "563,264": 1244, "362,292": 1245, "336,302": 1246, "116,290": 1247, "115,259": 1248, "273,701": 1249, "115,315": 1250, "102,105": 1251, "750,951": 1252, "337,298": 1253, "109,456": 1254, "957,107": 1255, "1048,296": 1256, "317,727": 1257, "32,279": 1258, "498,419": 1259, "514,346": 1260, "105,112": 1261, "818,256": 1262, "72,512": 1263, "773,330": 1264, "930,311": 1265, "107,547": 1266, "475,107": 1267, "303,469": 1268, "390,757": 1269, "114,267": 1270, "260,264": 1271, "1161,987": 1272, "447,272": 1273, "115,1007": 1274, "688,325": 1275, "734,32": 1276, "610,558": 1277, "119,362": 1278, "264,478": 1279, "121,769": 1280, "283,475": 1281, "928,275": 1282, "98,121": 1283, "305,950": 1284, "672,100": 1285, "102,362": 1286, "318,300": 1287, "599,482": 1288, "266,506": 1289, "309,290": 1290, "280,258": 1291, "114,294": 1292, "571,316": 1293, "612,102": 1294, "277,264": 1295, "305,101": 1296, "386,326": 1297, "579,310": 1298, "270,531": 1299, "642,337": 1300, "115,117": 1301, "32,349": 1302, "272,940": 1303, "73,1060": 1304, "394,508": 1305, "77,298": 1306, "629,256": 1307, "98,108": 1308, "518,337": 1309, "488,363": 1310, "658,286": 1311, "100,829": 1312, "115,896": 1313, "1106,116": 1314, "749,263": 1315, "112,350": 1316, "353,442": 1317, "644,623": 1318, "263,414": 1319, "83,907": 1320, "496,566": 1321, "1191,281": 1322, "107,911": 1323, "555,453": 1324, "365,310": 1325, "514,108": 1326, "76,1154": 1327, "506,705": 1328, "550,324": 1329, "551,108": 1330, "109,319": 1331, "967,103": 1332, "308,121": 1333, "271,597": 1334, "102,312": 1335, "121,684": 1336, "296,375": 1337, "279,272": 1338, "99,317": 1339, "99,367": 1340, "282,100": 1341, "609,844": 1342, "98,358": 1343, "287,264": 1344, "459,1104": 1345, "573,324": 1346, "300,434": 1347, "287,656": 1348, "659,258": 1349, "107,279": 1350, "1350,99": 1351, "441,341": 1352, "72,256": 1353, "479,407": 1354, "459,915": 1355, "115,275": 1356, "99,1108": 1357, "99,454": 1358, "352,318": 1359, "643,101": 1360, "101,285": 1361, "1062,116": 1362, "74,1090": 1363, "78,801": 1364, "523,32": 1365, "932,267": 1366, "764,469": 1367, "1083,528": 1368, "589,667": 1369, "263,300": 1370, "259,66": 1371, "345,271": 1372, "119,270": 1373, "99,978": 1374, "821,264": 1375, "115,1230": 1376, "1332,544": 1377, "464,32": 1378, "538,103": 1379, "110,268": 1380, "1095,1057": 1381, "299,1279": 1382, "546,303": 1383, "262,585": 1384, "581,350": 1385, "273,100": 1386, "324,438": 1387, "753,350": 1388, "270,110": 1389, "780,438": 1390, "1351,458": 1391, "525,117": 1392, "621,277": 1393, "100,1294": 1394, "443,466": 1395, "891,759": 1396, "1037,641": 1397, "366,631": 1398, "1398,116": 1399, "475,877": 1400, "606,407": 1401, "335,115": 1402, "319,272": 1403, "855,283": 1404, "119,395": 1405, "674,840": 1406, "305,356": 1407, "308,603": 1408, "451,863": 1409, "1362,270": 1410, "1410,117": 1411, "433,107": 1412, "99,114": 1413, "115,271": 1414, "998,342": 1415, "109,1026": 1416, "772,371": 1417, "304,907": 1418, "495,745": 1419, "82,111": 1420, "1420,120": 1421, "121,259": 1422, "366,340": 1423, "716,32": 1424, "405,1190": 1425, "295,730": 1426, "270,292": 1427, "704,358": 1428, "850,263": 1429, "110,696": 1430, "752,346": 1431, "1097,109": 1432, "697,413": 1433, "1032,267": 1434, "303,403": 1435, "403,291": 1436, "600,643": 1437, "765,32": 1438, "261,300": 1439, "699,118": 1440, "112,569": 1441, "102,1149": 1442, "102,760": 1443, "433,673": 1444, "545,100": 1445, "480,401": 1446, "435,352": 1447, "657,468": 1448, "317,112": 1449, "99,762": 1450, "1450,262": 1451, "496,114": 1452, "1066,954": 1453, "433,115": 1454, "725,497": 1455, "350,276": 1456, "1021,111": 1457, "1087,305": 1458, "613,974": 1459, "258,273": 1460, "522,351": 1461, "657,267": 1462, "492,34": 1463, "628,913": 1464, "68,724": 1465, "101,109": 1466, "1306,469": 1467, "530,852": 1468, "102,730": 1469, "77,374": 1470, "1470,277": 1471, "589,619": 1472, "476,111": 1473, "97,103": 1474, "63,32": 1475, "100,114": 1476, "262,417": 1477, "112,319": 1478, "553,359": 1479, "560,715": 1480, "285,256": 1481, "1215,970": 1482, "1140,292": 1483, "115,524": 1484, "703,325": 1485, "373,335": 1486, "772,513": 1487, "375,271": 1488, "343,512": 1489, "470,263": 1490, "87,104": 1491, "682,434": 1492, "618,111": 1493, "300,819": 1494, "620,100": 1495, "363,481": 1496, "116,331": 1497, "304,801": 1498, "435,285": 1499, "260,266": 1500, "258,454": 1501, "1196,483": 1502, "385,1425": 1503, "102,358": 1504, "613,838": 1505, "110,760": 1506, "615,338": 1507, "286,293": 1508, "324,584": 1509, "1335,281": 1510, "652,1337": 1511, "560,121": 1512, "276,272": 1513, "498,508": 1514, "521,814": 1515, "949,355": 1516, "112,1341": 1517, "104,338": 1518, "98,338": 1519, "988,115": 1520, "108,873": 1521, "862,292": 1522, "1015,101": 1523, "977,1079": 1524, "112,441": 1525, "495,769": 1526, "435,313": 1527, "676,325": 1528, "1081,102": 1529, "262,100": 1530, "111,98": 1531, "442,72": 1532, "108,417": 1533, "285,477": 1534, "110,1022": 1535, "295,579": 1536, "260,100": 1537, "100,441": 1538, "315,445": 1539, "1251,120": 1540, "98,286": 1541, "849,534": 1542, "302,293": 1543, "269,296": 1544, "467,450": 1545, "442,472": 1546, "602,454": 1547, "342,114": 1548, "117,116": 1549, "280,272": 1550, "871,300": 1551, "882,1016": 1552, "535,359": 1553, "112,858": 1554, "115,110": 1555, "1145,119": 1556, "475,449": 1557, "750,1315": 1558, "307,286": 1559, "307,582": 1560, "98,1064": 1561, "480,301": 1562, "393,434": 1563, "471,330": 1564, "832,461": 1565, "529,413": 1566, "433,808": 1567, "44,816": 1568, "627,291": 1569, "121,285": 1570, "396,747": 1571, "774,429": 1572, "618,275": 1573, "835,461": 1574, "121,288": 1575, "101,108": 1576, "318,509": 1577, "115,273": 1578, "683,261": 1579, "441,296": 1580, "109,282": 1581, "324,822": 1582, "751,283": 1583, "293,100": 1584, "839,576": 1585, "1377,310": 1586, "391,256": 1587, "352,288": 1588, "391,466": 1589, "256,478": 1590, "587,505": 1591, "102,441": 1592, "609,32": 1593, "80,358": 1594, "98,511": 1595, "1166,330": 1596, "258,324": 1597, "1167,112": 1598, "398,1056": 1599, "367,275": 1600, "65,265": 1601, "293,1281": 1602, "79,107": 1603, "1603,298": 1604, "770,388": 1605, "99,511": 1606, "443,487": 1607, "330,301": 1608, "87,939": 1609, "293,121": 1610, "87,256": 1611, "955,842": 1612, "100,1389": 1613, "849,109": 1614, "76,1456": 1615, "956,115": 1616, "118,622": 1617, "535,65": 1618, "1179,267": 1619, "100,456": 1620, "857,483": 1621, "893,263": 1622, "1399,105": 1623, "725,898": 1624, "964,325": 1625, "108,776": 1626, "767,326": 1627, "1627,295": 1628, "68,417": 1629, "1024,481": 1630, "279,266": 1631, "995,303": 1632, "119,950": 1633, "545,107": 1634, "315,116": 1635, "39,116": 1636, "309,104": 1637, "496,296": 1638, "1484,282": 1639, "520,625": 1640, "69,656": 1641, "108,723": 1642, "1560,410": 1643, "859,325": 1644, "115,490": 1645, "107,638": 1646, "335,303": 1647, "502,1117": 1648, "280,303": 1649, "108,338": 1650, "929,266": 1651, "1094,481": 1652, "1432,512": 1653, "99,544": 1654, "316,427": 1655, "758,365": 1656, "747,412": 1657, "1155,275": 1658, "334,759": 1659, "583,984": 1660, "1437,466": 1661, "300,639": 1662, "103,276": 1663, "469,1067": 1664, "273,266": 1665, "106,101": 1666, "537,472": 1667, "767,101": 1668, "640,282": 1669, "892,312": 1670, "101,320": 1671, "258,484": 1672, "492,1041": 1673, "564,915": 1674, "324,481": 1675, "259,78": 1676, "295,417": 1677, "900,313": 1678, "305,621": 1679, "671,275": 1680, "901,494": 1681, "794,32": 1682, "389,277": 1683, "122,101": 1684, "119,939": 1685, "806,586": 1686, "671,272": 1687, "1604,271": 1688, "637,1386": 1689, "104,272": 1690, "446,447": 1691, "291,315": 1692, "486,728": 1693, "105,400": 1694, "32,398": 1695, "68,268": 1696, "1696,501": 1697, "1205,461": 1698, "805,489": 1699, "926,280": 1700, "274,326": 1701, "1348,119": 1702, "109,1244": 1703, "682,814": 1704, "708,578": 1705, "901,109": 1706, "1246,286": 1707, "1394,276": 1708, "70,902": 1709, "1709,1178": 1710, "575,303": 1711, "422,482": 1712, "688,1011": 1713, "272,261": 1714, "652,586": 1715, "449,1142": 1716, "577,355": 1717, "492,383": 1718, "1175,1303": 1719, "721,110": 1720, "287,263": 1721, "1304,803": 1722, "1465,1547": 1723, "1291,1110": 1724, "115,1208": 1725, "687,355": 1726, "392,1143": 1727, "705,350": 1728, "1728,660": 1729, "112,317": 1730, "642,1249": 1731, "422,332": 1732, "1128,655": 1733, "420,262": 1734, "121,335": 1735, "892,1046": 1736, "100,631": 1737, "1737,1545": 1738, "1309,105": 1739, "305,636": 1740, "82,336": 1741, "589,625": 1742, "770,417": 1743, "282,903": 1744, "397,426": 1745, "284,458": 1746, "474,101": 1747, "495,367": 1748, "390,272": 1749, "835,526": 1750, "502,272": 1751, "1065,505": 1752, "271,576": 1753, "108,279": 1754, "1002,1030": 1755, "463,332": 1756, "260,719": 1757, "389,281": 1758, "366,104": 1759, "270,100": 1760, "437,566": 1761, "697,453": 1762, "282,556": 1763, "333,303": 1764, "1666,1330": 1765, "259,936": 1766, "1331,292": 1767, "422,1006": 1768, "366,108": 1769, "620,430": 1770, "519,115": 1771, "291,308": 1772, "101,433": 1773, "967,467": 1774, "541,466": 1775, "308,337": 1776, "640,343": 1777, "115,318": 1778, "98,263": 1779, "1518,844": 1780, "318,536": 1781, "289,488": 1782, "270,572": 1783, "279,288": 1784, "555,1388": 1785, "846,445": 1786, "32,506": 1787, "118,294": 1788, "84,331": 1789, "520,355": 1790, "463,267": 1791, "111,111": 1792, "1206,109": 1793, "1292,256": 1794, "110,336": 1795, "1795,264": 1796, "780,481": 1797, "1613,276": 1798, "114,369": 1799, "447,292": 1800, "775,272": 1801, "683,355": 1802, "584,320": 1803, "267,447": 1804, "115,483": 1805, "277,991": 1806, "866,1220": 1807, "617,325": 1808, "573,279": 1809, "308,572": 1810, "630,330": 1811, "103,117": 1812, "670,826": 1813, "520,261": 1814, "115,663": 1815, "273,608": 1816, "530,115": 1817, "797,676": 1818, "937,362": 1819, "115,889": 1820, "73,1143": 1821, "606,344": 1822, "1626,924": 1823, "114,375": 1824, "340,802": 1825, "442,79": 1826, "308,867": 1827, "1632,307": 1828, "785,270": 1829, "1829,99": 1830, "100,454": 1831, "108,760": 1832, "612,483": 1833, "678,622": 1834, "321,319": 1835, "496,116": 1836, "98,575": 1837, "1615,415": 1838, "105,256": 1839, "267,741": 1840, "69,109": 1841, "1184,661": 1842, "98,417": 1843, "105,122": 1844, "266,398": 1845, "109,325": 1846, "115,884": 1847, "777,554": 1848, "520,359": 1849, "492,359": 1850, "324,301": 1851, "320,385": 1852, "102,858": 1853, "108,276": 1854, "457,305": 1855, "681,1028": 1856, "451,623": 1857, "442,1210": 1858, "451,272": 1859, "1416,827": 1860, "553,667": 1861, "552,1254": 1862, "32,301": 1863, "84,1030": 1864, "272,536": 1865, "1646,264": 1866, "694,263": 1867, "402,415": 1868, "1113,272": 1869, "1322,32": 1870, "522,809": 1871, "847,271": 1872, "97,362": 1873, "849,494": 1874, "1066,279": 1875, "300,783": 1876, "1757,316": 1877, "119,268": 1878, "260,862": 1879, "753,641": 1880, "1328,889": 1881, "740,1194": 1882, "1327,263": 1883, "590,410": 1884, "642,897": 1885, "909,1660": 1886, "1197,261": 1887, "448,453": 1888, "789,272": 1889, "738,295": 1890, "789,32": 1891, "443,267": 1892, "300,410": 1893, "112,651": 1894, "1894,362": 1895, "528,272": 1896, "396,116": 1897, "1272,1153": 1898, "1053,330": 1899, "1009,118": 1900, "99,388": 1901, "1044,267": 1902, "518,1099": 1903, "282,572": 1904, "358,264": 1905, "1596,854": 1906, "84,262": 1907, "416,544": 1908, "620,709": 1909, "101,288": 1910, "520,10": 1911, "305,298": 1912, "70,270": 1913, "329,350": 1914, "815,405": 1915, "921,332": 1916, "112,465": 1917, "509,624": 1918, "1452,1238": 1919, "643,460": 1920, "855,291": 1921, "104,563": 1922, "802,258": 1923, "317,321": 1924, "935,275": 1925, "891,1589": 1926, "573,316": 1927, "326,116": 1928, "271,472": 1929, "897,276": 1930, "291,292": 1931, "260,757": 1932, "287,394": 1933, "1457,1238": 1934, "347,108": 1935, "1935,98": 1936, "108,267": 1937, "103,1139": 1938, "551,296": 1939, "352,513": 1940, "471,1396": 1941, "1222,261": 1942, "1232,275": 1943, "947,303": 1944, "315,596": 1945, "1628,346": 1946, "288,1355": 1947, "39,508": 1948, "749,1549": 1949, "541,460": 1950, "916,466": 1951, "535,718": 1952, "496,588": 1953, "259,1467": 1954, "413,533": 1955, "986,115": 1956, "329,110": 1957, "307,941": 1958, "422,291": 1959, "694,267": 1960, "779,115": 1961, "1834,904": 1962, "101,358": 1963, "112,104": 1964, "1411,313": 1965, "1011,1730": 1966, "70,295": 1967, "1967,588": 1968, "1061,359": 1969, "577,348": 1970, "83,673": 1971, "98,456": 1972, "112,918": 1973, "1316,105": 1974, "100,105": 1975, "351,310": 1976, "262,475": 1977, "1977,627": 1978, "312,957": 1979, "273,110": 1980, "559,109": 1981, "69,296": 1982, "523,623": 1983, "339,321": 1984, "99,333": 1985, "1182,276": 1986, "269,103": 1987, "770,579": 1988, "613,1299": 1989, "677,325": 1990, "524,1754": 1991, "103,902": 1992, "883,1854": 1993, "293,844": 1994, "320,1028": 1995, "1187,779": 1996, "1187,358": 1997, "320,610": 1998, "335,320": 1999, "271,548": 2000, "597,344": 2001, "75,374": 2002, "909,345": 2003, "115,616": 2004, "518,632": 2005, "115,339": 2006, "104,593": 2007, "1259,501": 2008, "798,512": 2009, "1570,100": 2010, "817,449": 2011, "979,1649": 2012, "704,365": 2013, "446,342": 2014, "752,296": 2015, "836,263": 2016, "98,309": 2017, "99,375": 2018, "421,121": 2019, "271,330": 2020, "324,427": 2021, "305,114": 2022, "104,329": 2023, "398,1121": 2024, "110,372": 2025, "260,1158": 2026, "925,453": 2027, "916,101": 2028, "1423,256": 2029, "1508,853": 2030, "393,1565": 2031, "364,272": 2032, "32,324": 2033, "287,102": 2034, "969,121": 2035, "591,261": 2036, "562,469": 2037, "1336,344": 2038, "330,349": 2039, "460,116": 2040, "259,1594": 2041, "597,272": 2042, "349,342": 2043, "103,511": 2044, "713,110": 2045, "620,1075": 2046, "501,307": 2047, "271,344": 2048, "97,361": 2049, "304,312": 2050, "288,406": 2051, "299,119": 2052, "1012,276": 2053, "1204,256": 2054, "71,111": 2055, "385,1080": 2056, "565,638": 2057, "518,327": 2058, "536,639": 2059, "115,420": 2060, "1019,32": 2061, "339,343": 2062, "97,853": 2063, "84,86": 2064, "115,374": 2065, "429,540": 2066, "66,1531": 2067, "1070,332": 2068, "350,111": 2069, "414,1799": 2070, "1699,704": 2071, "2071,779": 2072, "350,101": 2073, "1336,407": 2074, "640,918": 2075, "1702,105": 2076, "2076,461": 2077, "308,263": 2078, "102,511": 2079, "1349,1022": 2080, "398,1391": 2081, "1272,475": 2082, "370,1137": 2083, "621,641": 2084, "108,270": 2085, "634,332": 2086, "302,101": 2087, "63,34": 2088, "114,273": 2089, "1537,1617": 2090, "295,904": 2091, "1538,357": 2092, "490,543": 2093, "878,100": 2094, "1059,468": 2095, "536,434": 2096, "347,263": 2097, "103,585": 2098, "901,534": 2099, "689,108": 2100, "1167,809": 2101, "261,385": 2102, "617,549": 2103, "284,278": 2104, "109,1402": 2105, "1124,319": 2106, "340,489": 2107, "111,883": 2108, "261,590": 2109, "511,941": 2110, "295,115": 2111, "887,1552": 2112, "335,266": 2113, "937,904": 2114, "744,501": 2115, "33,10": 2116, "491,373": 2117, "361,478": 2118, "279,303": 2119, "788,534": 2120, "373,101": 2121, "1713,466": 2122, "1323,415": 2123, "300,728": 2124, "477,310": 2125, "1471,266": 2126, "260,99": 2127, "259,1409": 2128, "885,1100": 2129, "668,267": 2130, "102,745": 2131, "476,621": 2132, "719,470": 2133, "355,562": 2134, "1624,1181": 2135, "119,280": 2136, "107,362": 2137, "818,1057": 2138, "1013,116": 2139, "68,829": 2140, "79,116": 2141, "1716,549": 2142, "396,810": 2143, "782,916": 2144, "73,264": 2145, "570,359": 2146, "1308,1213": 2147, "600,1383": 2148, "1086,442": 2149, "1413,298": 2150, "2150,282": 2151, "1734,1514": 2152, "1623,1260": 2153, "306,618": 2154, "464,1023": 2155, "536,1406": 2156, "615,1007": 2157, "461,281": 2158, "109,369": 2159, "274,265": 2160, "1255,256": 2161, "270,118": 2162, "1091,34": 2163, "892,115": 2164, "523,1112": 2165, "101,325": 2166, "1393,275": 2167, "460,505": 2168, "97,272": 2169, "548,272": 2170, "68,579": 2171, "1217,625": 2172, "1973,276": 2173, "443,517": 2174, "476,485": 2175, "259,807": 2176, "69,265": 2177, "1486,275": 2178, "318,1643": 2179, "1130,266": 2180, "291,513": 2181, "515,116": 2182, "1031,647": 2183, "270,795": 2184, "99,276": 2185, "893,626": 2186, "315,509": 2187, "1567,371": 2188, "1491,2008": 2189, "960,267": 2190, "861,506": 2191, "121,396": 2192, "68,1873": 2193, "818,101": 2194, "1650,461": 2195, "1263,481": 2196, "506,116": 2197, "446,1118": 2198, "258,1221": 2199, "1326,272": 2200, "1431,683": 2201, "396,1653": 2202, "492,718": 2203, "300,1051": 2204, "497,403": 2205, "888,863": 2206, "965,333": 2207, "740,1195": 2208, "1656,398": 2209, "618,647": 2210, "433,264": 2211, "305,559": 2212, "945,317": 2213, "358,103": 2214, "1662,985": 2215, "324,528": 2216, "1583,582": 2217, "1157,1663": 2218, "305,295": 2219, "537,718": 2220, "1267,332": 2221, "83,801": 2222, "313,469": 2223, "567,278": 2224, "634,340": 2225, "367,121": 2226, "1274,256": 2227, "258,1899": 2228, "324,820": 2229, "107,294": 2230, "1266,310": 2231, "99,484": 2232, "388,487": 2233, "866,755": 2234, "545,554": 2235, "433,1100": 2236, "271,734": 2237, "655,529": 2238, "370,517": 2239, "689,508": 2240, "258,545": 2241, "397,406": 2242, "522,867": 2243, "895,32": 2244, "637,97": 2245, "552,316": 2246, "1013,317": 2247, "112,97": 2248, "115,302": 2249, "2249,433": 2250, "575,482": 2251, "110,500": 2252, "305,575": 2253, "2253,853": 2254, "311,314": 2255, "1777,272": 2256, "305,310": 2257, "700,272": 2258, "367,1914": 2259, "1519,1045": 2260, "472,576": 2261, "927,922": 2262, "615,107": 2263, "1522,1523": 2264, "98,902": 2265, "115,269": 2266, "559,710": 2267, "97,556": 2268, "111,350": 2269, "949,261": 2270, "618,268": 2271, "823,332": 2272, "819,617": 2273, "2065,332": 2274, "1697,558": 2275, "472,922": 2276, "622,272": 2277, "1020,576": 2278, "705,375": 2279, "1504,119": 2280, "34,483": 2281, "119,547": 2282, "553,596": 2283, "324,799": 2284, "574,521": 2285, "1044,303": 2286, "592,352": 2287, "100,1928": 2288, "438,344": 2289, "318,562": 2290, "362,415": 2291, "396,833": 2292, "98,375": 2293, "1280,912": 2294, "99,299": 2295, "581,1534": 2296, "1708,1295": 2297, "295,100": 2298, "2088,979": 2299, "553,908": 2300, "1290,486": 2301, "98,1249": 2302, "1606,119": 2303, "354,264": 2304, "489,116": 2305, "1180,1098": 2306, "271,539": 2307, "577,10": 2308, "1609,813": 2309, "1088,266": 2310, "448,732": 2311, "422,303": 2312, "299,305": 2313, "438,272": 2314, "461,292": 2315, "1819,544": 2316, "537,543": 2317, "1074,1944": 2318, "1543,264": 2319, "1458,292": 2320, "357,267": 2321, "98,579": 2322, "334,493": 2323, "308,292": 2324, "107,1760": 2325, "1721,803": 2326, "316,799": 2327, "340,965": 2328, "44,420": 2329, "1551,1633": 2330, "841,258": 2331, "1554,2118": 2332, "416,256": 2333, "288,711": 2334, "496,2120": 2335, "1246,473": 2336, "1555,465": 2337, "565,339": 2338, "2338,987": 2339, "349,280": 2340, "847,917": 2341, "333,275": 2342, "1206,100": 2343, "101,508": 2344, "1077,303": 2345, "1278,544": 2346, "1139,330": 2347, "522,337": 2348, "282,1017": 2349, "105,809": 2350, "98,374": 2351, "262,1298": 2352, "355,300": 2353, "1838,345": 2354, "777,531": 2355, "652,1006": 2356, "272,429": 2357, "1081,919": 2358, "623,2047": 2359, "97,258": 2360, "1813,1435": 2361, "370,267": 2362, "318,445": 2363, "1966,115": 2364, "99,1026": 2365, "746,272": 2366, "422,761": 2367, "98,1412": 2368, "461,111": 2369, "115,319": 2370, "1926,665": 2371, "301,449": 2372, "302,2117": 2373, "490,359": 2374, "644,1112": 2375, "737,350": 2376, "100,256": 2377, "595,295": 2378, "855,838": 2379, "739,693": 2380, "112,281": 2381, "105,335": 2382, "1165,494": 2383, "103,108": 2384, "969,603": 2385, "103,622": 2386, "66,1979": 2387, "103,786": 2388, "98,285": 2389, "642,717": 2390, "2158,1476": 2391, "97,373": 2392, "1023,504": 2393, "1759,547": 2394, "262,351": 2395, "392,1060": 2396, "524,1835": 2397, "413,607": 2398, "84,1310": 2399, "1182,101": 2400, "104,279": 2401, "2159,286": 2402, "2402,99": 2403, "2403,121": 2404, "118,1099": 2405, "2405,620": 2406, "1578,112": 2407, "872,2069": 2408, "681,1415": 2409, "2100,449": 2410, "1032,332": 2411, "2411,827": 2412, "633,646": 2413, "335,315": 2414, "492,625": 2415, "304,278": 2416, "442,1364": 2417, "518,1976": 2418, "542,405": 2419, "553,625": 2420, "1216,807": 2421, "370,938": 2422, "443,1647": 2423, "414,272": 2424, "524,339": 2425, "524,265": 2426, "101,305": 2427, "1421,263": 2428, "1490,1113": 2429, "267,1114": 2430, "420,796": 2431, "977,1569": 2432, "1037,277": 2433, "487,116": 2434, "1222,355": 2435, "116,272": 2436, "347,114": 2437, "355,590": 2438, "557,1153": 2439, "2439,695": 2440, "2440,2016": 2441, "610,913": 2442, "516,568": 2443, "550,279": 2444, "564,116": 2445, "315,521": 2446, "320,555": 2447, "1036,487": 2448, "256,695": 2449, "114,405": 2450, "109,485": 2451, "945,796": 2452, "107,636": 2453, "115,396": 2454, "1504,503": 2455, "521,434": 2456, "551,285": 2457, "1157,99": 2458, "1507,32": 2459, "1124,664": 2460, "114,417": 2461, "302,730": 2462, "103,277": 2463, "303,624": 2464, "1510,121": 2465, "446,316": 2466, "1150,427": 2467, "100,282": 2468, "1009,400": 2469, "108,319": 2470, "929,862": 2471, "510,111": 2472, "817,1771": 2473, "1443,291": 2474, "271,880": 2475, "471,825": 2476, "716,931": 2477, "398,794": 2478, "396,768": 2479, "271,501": 2480, "1495,626": 2481, "629,460": 2482, "480,334": 2483, "698,32": 2484, "1001,481": 2485, "461,636": 2486, "318,521": 2487, "751,104": 2488, "1519,863": 2489, "403,292": 2490, "295,119": 2491, "467,566": 2492, "2056,549": 2493, "119,274": 2494, "97,1136": 2495, "320,774": 2496, "283,662": 2497, "2497,1046": 2498, "103,293": 2499, "366,256": 2500, "792,266": 2501, "841,292": 2502, "1201,32": 2503, "396,888": 2504, "842,32": 2505, "1796,345": 2506, "1165,534": 2507, "446,1798": 2508, "259,348": 2509, "552,330": 2510, "794,272": 2511, "314,503": 2512, "102,319": 2513, "300,1035": 2514, "269,720": 2515, "717,266": 2516, "463,275": 2517, "1392,330": 2518, "589,828": 2519, "1806,121": 2520, "109,281": 2521, "804,263": 2522, "358,343": 2523, "1015,256": 2524, "102,277": 2525, "551,319": 2526, "305,829": 2527, "317,701": 2528, "669,294": 2529, "767,636": 2530, "99,1140": 2531, "1162,267": 2532, "926,447": 2533, "1426,544": 2534, "792,115": 2535, "480,682": 2536, "900,468": 2537, "373,264": 2538, "768,722": 2539, "937,100": 2540, "757,1444": 2541, "602,109": 2542, "106,337": 2543, "1133,324": 2544, "1089,331": 2545, "1718,439": 2546, "1719,1075": 2547, "1404,109": 2548, "881,107": 2549, "488,483": 2550, "480,521": 2551, "516,645": 2552, "1438,990": 2553, "348,271": 2554, "1464,1828": 2555, "1830,2113": 2556, "725,1098": 2557, "509,429": 2558, "920,32": 2559, "413,679": 2560, "314,373": 2561, "102,264": 2562, "291,318": 2563, "318,555": 2564, "1525,1788": 2565, "666,576": 2566, "119,694": 2567, "866,119": 2568, "2568,1211": 2569, "1818,279": 2570, "1723,271": 2571, "112,1454": 2572, "116,286": 2573, "280,292": 2574, "273,1374": 2575, "930,116": 2576, "535,452": 2577, "1308,1090": 2578, "497,843": 2579, "271,1212": 2580, "1729,346": 2581, "748,1137": 2582, "882,410": 2583, "74,465": 2584, "115,276": 2585, "386,110": 2586, "258,388": 2587, "2359,291": 2588, "1002,1310": 2589, "1637,838": 2590, "719,303": 2591, "1156,332": 2592, "316,820": 2593, "398,888": 2594, "2368,319": 2595, "112,333": 2596, "2596,112": 2597, "1313,735": 2598, "2141,522": 2599, "1157,361": 2600, "109,273": 2601, "102,293": 2602, "2602,99": 2603, "101,121": 2604, "559,565": 2605, "596,1735": 2606, "470,101": 2607, "118,111": 2608, "1785,1587": 2609, "262,266": 2610, "115,504": 2611, "282,271": 2612, "1254,1787": 2613, "1071,590": 2614, "881,112": 2615, "277,461": 2616, "103,350": 2617, "317,118": 2618, "635,531": 2619, "550,316": 2620, "1853,351": 2621, "733,427": 2622, "1715,310": 2623, "1958,286": 2624, "266,573": 2625, "1297,1333": 2626, "435,563": 2627, "441,2377": 2628, "366,319": 2629, "551,329": 2630, "514,114": 2631, "868,335": 2632, "536,1035": 2633, "1062,102": 2634, "2634,416": 2635, "2389,295": 2636, "565,108": 2637, "721,107": 2638, "457,307": 2639, "491,99": 2640, "2166,1441": 2641, "266,736": 2642, "1980,116": 2643, "2643,473": 2644, "1961,282": 2645, "1986,475": 2646, "116,117": 2647, "1163,507": 2648, "624,342": 2649, "274,266": 2650, "615,273": 2651, "269,330": 2652, "942,410": 2653, "464,1018": 2654, "98,350": 2655, "1481,803": 2656, "615,262": 2657, "567,262": 2658, "856,34": 2659, "79,75": 2660, "284,395": 2661, "1146,267": 2662, "271,830": 2663, "758,337": 2664, "548,320": 2665, "1029,32": 2666, "1144,100": 2667, "2667,641": 2668, "115,700": 2669, "464,115": 2670, "1103,266": 2671, "115,292": 2672, "352,320": 2673, "2162,954": 2674, "338,264": 2675, "589,502": 2676, "1049,1418": 2677, "87,1488": 2678, "715,796": 2679, "2006,357": 2680, "1566,833": 2681, "281,532": 2682, "624,501": 2683, "1426,978": 2684, "1492,537": 2685, "432,487": 2686, "2193,263": 2687, "103,311": 2688, "418,334": 2689, "1095,256": 2690, "119,1261": 2691, "606,363": 2692, "548,1753": 2693, "2015,263": 2694, "835,1374": 2695, "2437,110": 2696, "318,943": 2697, "107,435": 2698, "964,505": 2699, "44,663": 2700, "1758,263": 2701, "112,664": 2702, "810,412": 2703, "308,1040": 2704, "259,323": 2705, "256,2206": 2706, "1491,281": 2707, "1269,101": 2708, "1155,292": 2709, "600,1068": 2710, "1885,32": 2711, "2451,104": 2712, "567,458": 2713, "1503,318": 2714, "2022,1763": 2715, "567,341": 2716, "271,464": 2717, "2218,1227": 2718, "1122,410": 2719, "2025,409": 2720, "108,1584": 2721, "1657,1648": 2722, "509,469": 2723, "2219,116": 2724, "1219,742": 2725, "1765,454": 2726, "514,508": 2727, "2727,478": 2728, "597,1119": 2729, "72,105": 2730, "271,1072": 2731, "445,1160": 2732, "385,549": 2733, "965,546": 2734, "570,1041": 2735, "364,1052": 2736, "2030,528": 2737, "414,1590": 2738, "683,501": 2739, "340,698": 2740, "616,472": 2741, "266,279": 2742, "72,301": 2743, "1378,446": 2744, "1769,264": 2745, "1274,101": 2746, "732,880": 2747, "722,497": 2748, "321,32": 2749, "385,116": 2750, "458,275": 2751, "315,300": 2752, "440,517": 2753, "536,814": 2754, "112,326": 2755, "279,492": 2756, "881,487": 2757, "1132,1444": 2758, "104,786": 2759, "2241,32": 2760, "100,117": 2761, "945,1053": 2762, "1580,267": 2763, "97,809": 2764, "2247,1227": 2765, "2248,119": 2766, "1278,256": 2767, "1576,373": 2768, "274,100": 2769, "1912,267": 2770, "2050,32": 2771, "420,111": 2772, "272,509": 2773, "1659,1384": 2774, "2491,275": 2775, "334,1342": 2776, "681,558": 2777, "295,305": 2778, "320,712": 2779, "2264,655": 2780, "457,117": 2781, "2057,32": 2782, "687,261": 2783, "371,472": 2784, "519,303": 2785, "498,1045": 2786, "1224,398": 2787, "339,805": 2788, "366,339": 2789, "743,320": 2790, "282,399": 2791, "271,364": 2792, "292,762": 2793, "921,291": 2794, "270,116": 2795, "610,869": 2796, "305,350": 2797, "87,375": 2798, "1382,549": 2799, "655,486": 2800, "110,631": 2801, "2801,727": 2802, "564,1104": 2803, "498,114": 2804, "272,403": 2805, "1082,300": 2806, "300,2068": 2807, "520,1041": 2808, "463,517": 2809, "857,275": 2810, "797,2286": 2811, "2225,116": 2812, "321,664": 2813, "600,793": 2814, "334,260": 2815, "97,266": 2816, "315,933": 2817, "936,666": 2818, "918,302": 2819, "600,1047": 2820, "115,291": 2821, "336,312": 2822, "2822,270": 2823, "2296,310": 2824, "1932,101": 2825, "854,671": 2826, "83,111": 2827, "111,369": 2828, "1792,264": 2829, "988,276": 2830, "390,258": 2831, "80,117": 2832, "455,102": 2833, "300,327": 2834, "946,98": 2835, "1385,275": 2836, "84,2526": 2837, "1339,267": 2838, "98,2528": 2839, "1171,276": 2840, "2529,512": 2841, "2530,1017": 2842, "116,1053": 2843, "847,1141": 2844, "1137,484": 2845, "2079,103": 2846, "366,641": 2847, "266,729": 2848, "273,114": 2849, "665,408": 2850, "574,300": 2851, "1540,1258": 2852, "363,438": 2853, "258,280": 2854, "541,112": 2855, "1301,2315": 2856, "602,116": 2857, "2857,311": 2858, "1180,898": 2859, "562,1400": 2860, "728,398": 2861, "87,488": 2862, "1625,1823": 2863, "705,477": 2864, "271,995": 2865, "1380,755": 2866, "948,641": 2867, "115,1946": 2868, "1381,890": 2869, "295,503": 2870, "1462,695": 2871, "551,388": 2872, "1521,665": 2873, "754,1358": 2874, "464,291": 2875, "2108,293": 2876, "264,446": 2877, "112,2110": 2878, "640,573": 2879, "1179,468": 2880, "845,316": 2881, "347,103": 2882, "721,812": 2883, "121,574": 2884, "273,507": 2885, "109,1208": 2886, "905,838": 2887, "98,1298": 2888, "318,865": 2889, "339,573": 2890, "540,795": 2891, "488,1109": 2892, "384,727": 2893, "2893,277": 2894, "509,665": 2895, "933,741": 2896, "546,482": 2897, "940,709": 2898, "997,886": 2899, "702,695": 2900, "368,292": 2901, "784,109": 2902, "101,363": 2903, "1184,267": 2904, "383,439": 2905, "108,272": 2906, "292,2332": 2907, "446,324": 2908, "718,768": 2909, "316,1453": 2910, "359,300": 2911, "1833,590": 2912, "349,606": 2913, "270,1296": 2914, "2914,417": 2915, "1107,448": 2916, "1200,490": 2917, "114,1908": 2918, "115,330": 2919, "105,805": 2920, "609,1281": 2921, "259,1116": 2922, "110,1636": 2923, "108,2073": 2924, "318,2346": 2925, "347,264": 2926, "1511,267": 2927, "2127,1962": 2928, "2347,412": 2929, "291,1065": 2930, "87,331": 2931, "375,346": 2932, "103,460": 2933, "1634,517": 2934, "2280,812": 2935, "352,853": 2936, "1199,310": 2937, "510,470": 2938, "2938,311": 2939, "1300,256": 2940, "1661,403": 2941, "99,274": 2942, "1720,291": 2943, "324,1473": 2944, "931,484": 2945, "39,109": 2946, "570,543": 2947, "753,277": 2948, "969,1319": 2949, "115,1233": 2950, "1964,755": 2951, "74,111": 2952, "2952,104": 2953, "2953,646": 2954, "1302,606": 2955, "2097,605": 2956, "106,886": 2957, "506,1311": 2958, "669,1960": 2959, "700,420": 2960, "275,768": 2961, "99,433": 2962, "433,531": 2963, "307,736": 2964, "309,331": 2965, "2136,1290": 2966, "1237,280": 2967, "101,107": 2968, "266,765": 2969, "1472,486": 2970, "540,700": 2971, "540,615": 2972, "994,332": 2973, "1913,1045": 2974, "1592,556": 2975, "1968,263": 2976, "1841,1846": 2977, "1725,276": 2978, "368,919": 2979, "1144,256": 2980, "893,101": 2981, "1473,867": 2982, "924,101": 2983, "119,278": 2984, "919,675": 2985, "2985,114": 2986, "2986,373": 2987, "471,543": 2988, "559,305": 2989, "1237,316": 2990, "745,1530": 2991, "1301,791": 2992, "506,2379": 2993, "269,400": 2994, "1086,288": 2995, "260,1489": 2996, "447,315": 2997, "84,1851": 2998, "2617,280": 2999, "476,912": 3000, "1036,335": 3001, "352,442": 3002, "1063,311": 3003, "878,109": 3004, "596,1247": 3005, "580,300": 3006, "669,1490": 3007, "994,487": 3008, "422,812": 3009, "100,335": 3010, "324,1556": 3011, "295,518": 3012, "3012,103": 3013, "3013,110": 3014, "3014,1844": 3015, "1478,116": 3016, "688,316": 3017, "1354,363": 3018, "288,1092": 3019, "1460,461": 3020, "78,111": 3021, "301,410": 3022, "1729,108": 3023, "2627,98": 3024, "3024,736": 3025, "279,315": 3026, "1468,1093": 3027, "1316,104": 3028, "1015,591": 3029, "614,268": 3030, "342,1112": 3031, "587,330": 3032, "350,275": 3033, "1008,1533": 3034, "836,466": 3035, "1821,1253": 3036, "792,507": 3037, "284,1030": 3038, "2024,121": 3039, "294,263": 3040, "1548,258": 3041, "617,605": 3042, "2165,1330": 3043, "3043,634": 3044, "3044,591": 3045, "102,326": 3046, "102,2644": 3047, "101,1009": 3048, "67,278": 3049, "366,97": 3050, "1532,769": 3051, "79,296": 3052, "888,317": 3053, "1849,1027": 3054, "1981,1478": 3055, "115,288": 3056, "108,116": 3057, "1963,118": 3058, "3058,350": 3059, "767,105": 3060, "1173,320": 3061, "1554,99": 3062, "324,362": 3063, "783,320": 3064, "2651,112": 3065, "1856,729": 3066, "620,410": 3067, "342,623": 3068, "318,1277": 3069, "1718,10": 3070, "320,686": 3071, "2655,104": 3072, "2267,512": 3073, "510,279": 3074, "1174,342": 3075, "2657,296": 3076, "561,719": 3077, "1440,582": 3078, "572,438": 3079, "637,776": 3080, "507,325": 3081, "790,486": 3082, "875,434": 3083, "1416,1352": 3084, "1991,101": 3085, "553,807": 3086, "480,581": 3087, "295,352": 3088, "577,359": 3089, "271,1641": 3090, "537,1365": 3091, "2221,1029": 3092, "577,548": 3093, "1395,429": 3094, "994,335": 3095, "869,266": 3096, "288,807": 3097, "1089,256": 3098, "988,373": 3099, "3099,266": 3100, "335,275": 3101, "293,531": 3102, "1063,272": 3103, "1862,2625": 3104, "3104,2173": 3105, "1862,1289": 3106, "3106,1544": 3107, "2613,1544": 3108, "1856,558": 3109, "1861,1214": 3110, "1059,2181": 3111, "1145,103": 3112, "553,1276": 3113, "684,770": 3114, "3114,296": 3115, "1105,320": 3116, "65,2675": 3117, "2104,344": 3118, "642,294": 3119, "75,283": 3120, "750,32": 3121, "98,1257": 3122, "2002,263": 3123, "330,944": 3124, "613,1149": 3125, "815,886": 3126, "1745,271": 3127, "315,385": 3128, "1423,101": 3129, "962,2186": 3130, "355,509": 3131, "960,275": 3132, "2430,272": 3133, "3133,1114": 3134, "102,367": 3135, "1746,910": 3136, "1371,1867": 3137, "485,275": 3138, "355,797": 3139, "66,1867": 3140, "1036,1000": 3141, "1871,695": 3142, "1150,478": 3143, "404,256": 3144, "1219,584": 3145, "1570,257": 3146, "875,1563": 3147, "258,530": 3148, "1745,2689": 3149, "490,606": 3150, "3150,2012": 3151, "1495,365": 3152, "89,335": 3153, "682,819": 3154, "358,320": 3155, "818,591": 3156, "308,1223": 3157, "541,1573": 3158, "577,261": 3159, "108,786": 3160, "3160,532": 3161, "1498,261": 3162, "1224,944": 3163, "1434,2701": 3164, "3164,698": 3165, "3165,1879": 3166, "504,32": 3167, "109,573": 3168, "334,1501": 3169, "422,475": 3170, "852,412": 3171, "2023,311": 3172, "1097,812": 3173, "2216,318": 3174, "332,446": 3175, "279,396": 3176, "758,632": 3177, "2205,272": 3178, "721,32": 3179, "437,915": 3180, "3180,32": 3181, "1890,101": 3182, "2725,584": 3183, "259,966": 3184, "864,316": 3185, "1766,472": 3186, "551,886": 3187, "739,387": 3188, "291,507": 3189, "1765,840": 3190, "392,116": 3191, "308,345": 3192, "318,864": 3193, "861,975": 3194, "98,279": 3195, "1769,116": 3196, "712,1273": 3197, "464,468": 3198, "597,363": 3199, "865,447": 3200, "795,1379": 3201, "745,345": 3202, "2463,276": 3203, "119,295": 3204, "119,111": 3205, "627,838": 3206, "549,303": 3207, "449,434": 3208, "118,277": 3209, "416,267": 3210, "758,264": 3211, "99,286": 3212, "731,469": 3213, "1901,101": 3214, "2224,272": 3215, "2041,1235": 3216, "117,266": 3217, "2199,